app/views/comments/_count.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
コメント数：<%= book.comments.count %>