app/views/comments/_index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
<table>
  <% book.comments.each do |comment| %>