app/views/books/_table.html.erb

    </td>
    <td>コメント数：<%= book.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 10]]