app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all.order(params[:sort])

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "リーダブルコード"], ["body", "定番"], ["user_id", 1], ["created_at", "2021-06-07 22:49:48.533784"], ["updated_at", "2021-06-07 22:49:48.533784"], ["rate", 1.0], ["category", "定番"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save