app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    @book = Book.new
    @groups = Group.all

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @group = Group.find(params[:id])

INSERT INTO "groups" ("name", "introduction", "image_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @group = Group.new(group_params)
    @group.owner_id = current_user.id
    if @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "group_users" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["group_id", 3], ["created_at", "2021-06-07 04:30:11.608941"], ["updated_at", "2021-06-07 04:30:11.608941"]]
---
  def join
    @group = Group.find(params[:group_id])
    @group.users << current_user

UPDATE "groups" SET "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["image_id", "99dd36bf680f5fae7af4439014cbaca2e049587a452e80b7970845391ae4"], ["updated_at", "2021-06-06 21:03:58.793810"], ["id", 1]]
---
  def update
    if @group.update(group_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "group_users" WHERE "group_users"."group_id" = ? AND "group_users"."user_id" = ?  [["group_id", 3], ["user_id", 2]]
---
  def destroy
    @group = Group.find(params[:id])
    @group.users.delete(current_user)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new_mail
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def send_mail
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def ensure_correct_user
    @group = Group.find(params[:id])