app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."created_at" BETWEEN ? AND ?  [["user_id", 1], ["created_at", "2021-06-04 00:00:00"], ["created_at", "2021-06-04 23:59:59.999999"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new
    @today_posts = @user.books.where("created_at >= ?", Date.today)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ? AND (created_at LIKE '2021-06-05%' )  [["user_id", 1]]
---
  def book_count_search
    @user = User.find(params[:user_id])
    @books = @user.books
    @book = Book.new
    if params[:created_at] == ""
      @search_book = "日付を選択してください"
    else
      create_at = params[:created_at]
      @search_book = @books.where(['created_at LIKE ? ', "#{create_at}%"]).count

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def following #フォローした人の一覧ページ(following)
    @title = "Follows"
    @user = User.find(params[:id])