app/models/user.rb

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(other_user)
    active_relationships.find_by(followed_id: other_user.id).destroy